//
// This work is copyrighted. Copying, cloning or stealing is prohibited.
//

const trans_uk = {
    "lang": "Українська",
    "currentLanguage": "Поточна мова: ",
    "showpatchnotes": "Показати примітки до виправлення",
    "hide": "Приховати",
    "view": "Перегляд",
    "remove": "Видалити",
    "page": "Сторінка",
    "mixedimages": "Змішані зображення",
    "mixtype": "Тип суміші",
    "ON": "УВІМКНЕНО",
    "OFF": "ВИМК.",
    "leftright": "Ліворуч/Праворуч",
    "topbottom": "Верх/Низ",
    "fusion": "Злиття",
    "random": "Випадковий",
    "frame": "рамка",
    "madeby": "Зроблено Шротті",
    "based": "На основі Scrap Clicker 2 від Schrott Games",
    "idea": "Ідея від 11.09.22, розроблена з 24.10.22",
    "version": "Версія",
    "from": "Зображення бочки з",
    "wiki": "англомовна Вікі для скрап",
    "wikipedia": "прапори з Вікіпедії",
    "data": "Я не маю доступу до будь-яких ваших особистих даних, зберігаються лише ваші улюблені змішані імена та налаштування.",
    "howtouse": "ЯК ВИКОРИСТОВУВАТИ:",
    "justclick": 'Просто натисніть "Змішати!" Це так просто!',
    "explanation": 'Натисніть "Вибране", щоб додати змішане імя до вибраного, "Назад", щоб повернутися до попередньої комбінації.',
    "usage": "Використовуйте його, щоб знайти смішні комбінації імен або отримати натхнення для нових бочок!",
    "mix": "Змішайте!",
    "favorite": "Улюблений",
    "favorites": "Вибране",
    "backButton": "Повернутися",
    "firstPageButton": "Перша сторінка",
    "previousPageButton": "Попередня сторінка",
    "nextPageButton": "Наступна сторінка",
    "lastPageButton": "Остання сторінка",
}

const names_uk = `
1: Синє Коло
2: Рожевий Квадрат
3: Смітник 
4: Білборд 
5: Поштова Скринька 
6: Синій Кубоїд 
7: Подивіться вгору 
8: Спіраль 
9: Сміттєвий Кошик 
10: Кавун
11: Я кохаю тебе 
12: Синій Вир
13: Надобраніч 
14: Я бачу тебе
15: Входу немає 
16: Дереволікар 
17: Листковий Торт 
18: Мерехтлива Зірка 
19: Ще більше шарів 
20: Неонове Сміття
21: Зав'яжи свої шнурки 
22: Банановий Отвір
23: Шестикутник рожевий 
24: Знамення Часів
25: Відро для сміття
26: Відтінки сірого
27: Неправильний напрямок
28: В якому напрямку?  
29: Відкритий широко 
30: Я тебе теж бачу
31: Ілюмінати 
32: Посилок немає 
33: Зелена Рапсодія 
34: Подвійний стрибок 
35: Закрути Лайм!
36: Коробка 
37: Козирок 
38: Прогулянка під Сонцем
39: Швидке Перемотування 
40: Шестикоробка 
41: Феєрверк 
42: Живопліт 
43: Не надто жирний 
44: Бак для сміття 
45: Прямо вниз 
46: Перемотування Назад 
47: 2 відразу 
48: Кінець Початку
49: Фіолетовий Вир
50: Я не чую тебе 
51: Дежавю 
52: Гра у фігури 
53: Кокос 
54: Пляма
55: Тостер 
56: Комусь пощастило 
57: Скільки відтінків? 
58: Ліпше купіть Коричневе 
59: Малинове Варення
60: НЕ ВІДКРИВАТИ
61: Вишнева Бомба 
62: Тільки для медиків 
63: Неополітанський 
64: 32 мільйони
65: Прочитав?
66: Гіза в сірому
67: Вугілля 
68: Будь обережним з Цим 
69: Ляльковий Туалет 
70: Не чорний 
71: Цунамі 
72: Не надто свіжий
73: Гіпноз 
74: Небезпечна Зона 
75: Починання 
76: 8 М'яч 
77: Воно живе! 
78: Полум'я
79: Перевернутий Верх 
80: Плавильний Горщик 
81: Пан Коричневокамінь
82: ААААРҐХ!!! 
83: Пікселізований 
84: Сторож
85: Поза фокусом 
86: Випусти мене 
87: Потрійна біда 
88: Азімов 
89: Я цього не робив 
90: Порожнеча
91: Не на Місці 
92: Шматочок Кавуна 
93: Нормандія 
94: Ендте 
95: Час вийшов 
96: Акуратність
97: Хром 
98: Слава... 
99: Полок 
100: Арахіс 
101: Номер Два 
102: Тор
103: Швейцарський 
104: Клітка 
105: Мобільна Доставка 
106: Похмілля 
107: Різдво 
108: Гаряча Штучка
109: Десь... 
110: ОЗ 
111: Слейд
112: Світ навиворіт 
113: Суші-Рол
114: Мій солодкий...
115: Сміттєвий Бак на колесах
116: ЛаКроко
117: Кава для Вампіра
118: Підключи й Грай
119: Медова Насолода
120: Вхід для Санти
121: Де Тост? 
122: П'яний
123: Флойд 
124: Бажаємо вам ...
125: ...Щасливого Різдва
126: Підпишіть тут
127: Коробка Цукерок
128: Бо я голодний 
129: Пиво Санти
130: Тому, з любов'ю від Джеррі
131: Царь Гори
132: Молоко й Цукор
133: Морозний
134: Залишилось 10 секунд...
135: Де Соломинка?
136: Джеррі, з любов'ю від Тома
137: Загвинтований
138: Ця трава справжня?
139: Заряджено
140: Оглядовий майданчик Lego
141: Кряк
142: Міжгалактичний 
143: Зелений бак для води
144: Великі вогняні Кулі
145: Щасливий Сік II
146: Тра-та-та
147: Чиста Енергія
148: Жбурляй їх
149: Не вистачає шматочку
150: Невагомість
151: Ніч ожилої Бочки
152: Захід Cонця
153: Розпалювання по-старому
154: Де Папір?
155: Де Молоко?
156: 128 ГБ
157: Шоколадобочка
158: Жабеня Керміт
159: Надії та Мрії
160: Серцевий напад
161: Просто продовжуй плавати
162: Ендтемейстер
163: 2Д6
164: Напої за мій рахунок
165: Бочка Баха
166: Важка ситуація
167: Втеча з кімнати
168: Кольоровий Пазл
169: SC Планшет 2.0
170: Зроби рішучий крок
171: Хто я?
172: Кому дзвонитимеш?
173: Без діла слабіє сила
174: Нескінченність
175: Як справи, Доку?
176: Мохіто
177: Додай гучности!
178: Синя Рапсодія
179: Дроворуб
180: Перекур
181: Гра престолів
182: Огидний
183: Джекпот
184: Супер Ендте Брос
185: Вимкнули світло
186: Де бургери?
187: Темна сторона бочки 
188: Вибачте!
189: Ананас
190: Мені залишитися чи піти?
191: Якщо життя дає вам лимони
192: Не їсти
193: Самгейн
194: Мерло
195: Мяу!
196: Ти це чуєш?
197: Чай на двох
198: Ешер
199: Очищений
200: Аль Денте
201: Картонна сорочка
202: Чашечка Джави
203: Кібер Молоко
204: Чемпіон
205: Їстівне
206: Будь ласка, змийте за собою!
207: Шардоне
208: 3.47
209: К-Вірус
210: Хмара 9
211: Гавана
212: Протиотрута
213: Туз в рукаві
214: Пейот
215: Нижче нуля
216: 180
217: Подай мені дробовика...
218: Є чим запалити?
219: Кінець гри
220: Крутий, але холодний
221: З Днем Народження, Scrap 2
222: Ліпше не пий
223: Зберігати в сухому місці
224: Синій чи зелений...?
225: Масниця
226: Піцова вечірка!
227: Пудинг
228: Штамп не потрібен
229: Подвоюю!
230: Біт
231: Карат
232: Сьорбати!
233: Джек й Джилл
234: Коров'ячий Сік
235: Нумо літати зі мною!
236: Спочивай у Мирі
237: Обережно, Хакери!
238: П'ятивежа
239: Не занадто гарячо
240: Не занадто холодно
241: Де перець?
242: Неможливобочка
243: А це точно бочка?
244: Спантеличеність
245: Де музичний автомат?
246: Єретик
247: Що ти вмієш?
248: Патронник
249: Неон
250: Не лизати
251: Ребристий
252: Крекер проти Печива
253: Дамська ніч
254: Газовано
255: Вічна Темрява
256: Мегіко
257: Спеціальна Доставка
258: Ще млинців?
259: Одного не вистачає
260: У вас нове повідомлення
261: Де голка?
262: Нічна лихоманка
263: Вакцинація
264: Бочка (Ґ) Ї264
265: ЕОМ
266: 2πd(R-r)
267: Зловмисність
268: З любов'ю
269: Вогонь!
270: НС в Туалеті
271: Сині стопки
272: П'ять О
273: Тропічний коктейль
274: Навколо Світу
275: Прямо з Піцаленду
276: Де Текіла?
277: 16П23Л42П
278: Синя магія
279: Увімкнено чи Вимкнено?
280: З днем Кукурудзи!
281: По бочці в день
282: Відкривати обережно
283: Хроніки Scrap
284: Смакота!
285: Вареники
286: Тессеракт
287: Час грати у Scrap!
288: Веселковий торт
289: Час з'єднувати!
290: Багато шухляд не буває!
291: Брухтобакси
292: Воскова крейда
293: Тривимірний Цукор
294: Придатний до Червня 2019
295: Копійок не знайдеться?
296: Не птах
297: Експертно нарізаний
298: 1969
299: Не упускати
300: Котра бочка?
301: Віч-на-віч
302: Шестерні
303: Мої документи
304: Швидко до справи!
305: Запашна лаванда
306: Нескінченна губка
307: До Місяця!
308: Де соус для баранини?!
309: Як правильно їсти це?
310: Крутний момент
311: Нове та вдосконалене
312: З Ангару
313: Не застрягни тільки
314: Дивна паста...
315: Де майонез?
316: Готовий до вживання
317: Дуже смачно
318: Садочок
319: Неймовірна випічка
320: Дитинство
321: Кухоль кави
322: Спіймав!
323: Минуле і Сьогодення
324: Ланцюгова реакція
325: Єгипетський Кубоїд
326: Дуже гаряче!
327: Як їсти це?!
328: Струсіть це
329: Де хот-дог?
330: Готово!
331: Качиний суп
332: Будь-який шлях, але...
333: Розумна жаба
334: Ще один шов...
335: Крик!
336: Чудернацький сік
337: Де масло?
338: Холодний прийом
339: Послухай, будь ласка
340: Ніндзя
341: Піт-стоп!
342: Нічого не чіпай
343: Курка чи качка?
344: C12H12
345: Скринька зі сюрпризом
346: Де мій бургер?
347: Галявина
348: Підстрижіться!
349: Сміттєчипси
350: Що готуєш?
351: Не годуй розробника
352: Гравітація
353: Світло й темрява
354: Хмарочос
355: Гаряче та пряне
356: Пан Робот
357: Шинка на пару
358: Як стати багатим
359: А тепер навпаки
360: Инший Вимір
361: Шеф-кухар
362: Вгадай слово
363: На будь-який випадок
364: Де Зайчик?
365: 147
366: Немає в наявності
367: Крякучино
368: Розлом
369: Одужуйте!
370: Супутник 15
371: Глибокий вдих
372: Твердий стан
373: Бочка-компаньйон
374: Дім, милий дім
375: Обери свого улюбленого!
376: По 2
377: Заливати в бензобак!
378: Шах і мат!
379: 1000°C
380: Омлет чи яєшня?
381: В яблучко!
382: Локшина
383: Я тут, а ти де?
384: Морозне морозиво
385: *звуки відрижки*
386: Що грає?
387: 7.0
388: Гіркий цитрус
389: Підключати в розетку
390: Сорбет
391: Зроби паузу
392: Шляхетність
393: Вітамінна Бомба
394: А пахне як...
395: Ген Людини
396: Троянди і шипи
397: Де лицарі?
398: Багатоповерхівка
399: Стоп... Час з'єднувати!
400: Вітання!
401: Киньте монетку
402: Незнаний бренд
403: Бульбашковий чай
404: З морозилки
405: Де желе?
406: Вся історія
407: Код 0000
408: 50 Гц
409: Ціль досягнута
410: Де чорниця?
411: Теоретичні космічні хвилі
412: Вітамін D
413: Де більярд?
414: Ви б випили це?
415: Максимальна Енергія
416: Рай для курця
417: Масниця 3.0
418: Будь ласка, допоможи мені
419: Куди вони діваються? 
420: Сьогоднішня їжа
421: Вартовик Вінтажу
422: Шоколадна Мрія
423: Баварія
424: Меду не давати
425: П.С.В.В.
426: В морозилці з 2007 р.
427: Щось заварюється
428: Точки зору
429: Безліч Вітамінів
430: Спалімо це!
431: Направо, а потім наліво
432: Не той важіль
433: Воно серед нас
434: Вічна пам'ять...
435: Годинник заблоковано
436: Наступний Рівень
437: Отрута!
438: 1996-2020
439: Домашня
440: Солене, але солодке
441: Спраговидаляч 3000
442: Так, у нас це є!
443: Ореореореорео
444: Інструкція Вічного Двигуна
445: Ми замовили ще
446: Дані чудові, чи ні?
447: Рокерська Вечірка
448: Пірамідка 
449: Хто це з'їв?
450: Не для плавання
451: Просто залиш це
452: Резонанс
453: Дай мені їжу!
454: Квітковий
455: 5 чого?
456: Вибух із Минулого
457: Де сир?
458: Гнилий!
459: Доставка триває
460: Будь-який колір
461: Зупинись прямо там!
462: Піца Віто
463: Домашній Засіб
464: Кубоїд для мурах?
465: Чудо-штука
466: Кряк v4.0
467: Для Літературного Клубу
468: Книжечка Жахів
469: Я щасливий турист!
470: Земля, якою ми її знаємо
471: Лампа зверху
472: Велика Жадібність
473: Хто винен?
474: Вежа Капрезе
475: Естетизм
476: Скибки Калію
477: Основа Руїн
478: Рубус
479: Ірбіс
480: Час арахісового желе
481: Допоможе вночі
482: Робота зварників
483: Том Розумности
484: Бос усіх шаф
485: Заява про моду
486: Арканічний ліфт
487: Понюхаємося пізніше!
488: РАШ Б
489: З 8 до 16-біт
490: Полуничний ля Крéм
491: Блискучий Смак
492: Боляче не буде...
493: Рогалик
494: Чудний Світ
495: Драматичне воскування
496: Нове Покоління
497: Фруктово!
498: Синюватий Желатин
499: Де мавпочки?
500: Готово!
501: Дорога до раю 
502: З дна океану 
503: преЧУДОво, ми загубилися
504: Це барабани?
505: За що заПЛАТИв?
506: Лайфгаки з'єднання бочок
507: Чорнокнижництво... 
508: Божевільна архітектура
509: Покинутий сад
510: Лимонна кислота
511: Азарт, але це Різдво 
512: 12.65 В
513: Портативна зима
514: Прототип
515: Бадьора настойка
516: Кукурудзяна цукерка
517: Пентагон спустошення
518: З Гаражу
519: Тріумвірат Сили
520: Клен і Сироп
521: Шоколадні цегли
522: Ти мусиш конструювати...
523: Доза смерти
524: Наведіть це сюди!
525: Ланч-бокс зі Сходу
526: Кольорова енерґія
527: Натисніть, утримуйте, з'єднуйте!
528: Величний майстер
529: Спогади
530: Ти хто такий?
531: Schrott каже
532: Повернення ожилої Бочки
533: Ви спробували змінити це?
534: Найшестикутніший шестикутник
535: А ось і скарб!
536: Знайдіть фраґменти
537: Обмежений час
538: Денс-бомба!
539: Скільки часу до кінця?
540: Дивися під ноги!
541: Насліддя
542: Поліпшення виконано!
543: Кондуктор
544: Моторошна & лячна бочка
545: Планета 9
546: Дефраґментація!
547: Пішли до міста
548: Особлива космічна подорож
549: Святкування
550: Завірюха
551: Мова чужих
552: 4000 обертів/хв
553: Це дуже популярне
554: Паралельний Голлівуд
555: 2+2=
556: Стародавня знахідка
557: Дивне в'язання
558: Законсервований торт
559: Атомні хроніки
560: Хатка для Хоми
561: Руїни
562: Ось мій гараж
563: З комфортом
564: Самий справжній
565: Швидкий спуск
566: Альфред, король бочок
567: Їстівне?
568: Предок ПК
569: Швидка нарізка
570: Неочікуваний сюрприз
571: Vampire Slaying Powder
572: Far Away...
573: Please, beehive!
574: 1 Million Scoville
575: Thai Lemon
576: Stoker's Hearth
577: Original Recipe
578: Cooper, do you copy?
579: Annoying Aviator
580: Scrapeo and Juliet
581: The Bouncer
582: Error 503
583: Fairy Dust
584: 6 feet deep
585: Anti-Fire 5
586: In 50 years...
587: Artist's Arsenal
588: Sundown
589: Smooth, cool, nutritious
590: Merge or Click?
591: From the Shadows
592: The Cave of the Barrels
593: Power Your Scrap
594: You just got Macaroon'd!
595: Точно шоколад?
596: Прокладка
597: Виміри Антиматерії
598: Смак пари
599: Не для читання
600: Ще один ювілей
601: Сміттєчіпси 2 - Відродження
602: RTX 9030
603: Електрична рама
604: Інша цивілізація
605: Скрапбургер
606: На дно моря
607: Яким шляхом ми йдем?
608: Скраблуко
609: Наріж це правильно
610: Небезпечний слиз
611: Фен-шуй
612: Скрап головоломка
613: Не для плавання
614: Іжа біля багаття
615: Не корона
616: Кабосу
617: Зловмисне поширення
618: Розвісив сушитися
619: Always watching
620: The Hero Called H
621: Cornbread 
622: Ascorbic Beam
623: S-800
624: Shimmering Aether
625: Magnet Attractor Mk.IV
626: Fur of the Tiger
627: Kittyball! 
628: Another Dollar Wasted
629: Free hook-ups!
630: Chess... flavored?
631: Lunar Potion
632: Old Science
633: Beta Pictoris
634: Pip-Duck 4000
635: Shiny Barrel
636: Going nuclear
637: Copper Tower
638: Ultimate gamer move!
639: Eldritch hatching grounds
640: Electric Eye
641: TechCube 3000
642: Finger Drug
643: Artistic Revolution
644: Scrapdines
645: Pink Simulation
646: RETURN THE SLAAAB
647: Poison Pool
648: ScrapTOS
649: Stone & Dirt
650: Jugs and Slopers
651: Please Don't Die
652: Scraptory
653: Cleats
654: Sweet Memories 
655: Please wait 60 seconds!
656: Stop... you failed!
657: NOSE
658: Her favorite drink
659: Fairy Acid
660: Don't put...
661: Peter
662: The 1,000,000th Star
663: Shapeshift
664: Acceleration Road
665: Can I Sell This?
666: Barrel to Hell
This milk is nuts!
Stop Meat Consumption!
Where's the Corn?
No Electricity Bills
Where's the Base?
A Coat of Nero
Nine Inch Barrels
Spice up your life!
Not a Bowl!
How to watch this?
Better than Wood!
Ice-B
Frosty v. Yule
Recycle Hole
Festive Housing
Potion to Self-Ignite
Compact Glow
Keep Your Neck Warm!
Verdure
The Power of your Soul
I'm lost! help
I'm colorblind! help
Scrapyard Jazz
XOXO
Cherry On Top
Heavy Construction
Pink Layers
Knife Hit
Final Castle
Life finds a Way
Ultimate Heat Heater
Where's Happy Juice?
Floats in a Tub!
Heart of the Sea
Where's the Beach?
Next Level Gaming
Magma Cone
Hill of the Orient
Shocker!
Yerba Mate
Nature's Pitchers
Crack Me
A+
Mystery Pods
Deadly Laser 250
That didn't age well
CYMK
Triple-Double
Daydreaming
Warhol
Futhark
Lost Parcel
Baby pink!
Beer Food
Human Resources
Kingdom Defender
Bocchi
The Rock
Green Bunny
The Mirror to Nowhere
More sides - more fun
Inky Writing
Rome & Venice
Celebrate Death
Sigh... unzips pants
EXP: 11/28/2004
Mad Hat Solution
ScrapRPG
Purple, and forgotten
The Perfect Tower
The Desert Rose
SSD GigaEnergy
Press "E" to Disarm
The numbers, Mason!
Bald Bird
Gems of Power
"Frightening"
Return to monke!
Officer Duck
50% more quiet!
Where's the Pasta?
Do not throw
Getting Funky With Gravity
Good, Bad, and Quacky
A Starry Sea
Plants as White as Snow
Cretaceous
Sangria
Good Morning
Don't get frostbite!
Determined to Burn
Taking shape
Overgrowth
Shines Eternal
Erosion
Updraft
`