//
// This work is copyrighted. Copying, cloning or stealing is prohibited.
//

const names_ru = `
1: Синяя и круглая
2: Розовая и квадратная
3: Урна для мусора
4: Место для вашей рекламы
5: Почтовый ящик
6: Синий кубоид
7: Посмотри наверх
8: Спираль
9: Мусорное ведро
10: Арбуз
11: Я люблю тебя
12: Синий вихрь
13: Спокойной ночи
14: Я тебя вижу
15: Входа нет
16: Древесный лекарь
17: Слоёный пирог
18: Маленькая звездочка
19: Многослойный
20: Неоновый мусор
21: Завяжи свои шнурки
22: Банановая дыра
23: Розовый шестиугольник
24: Знамение времен
25: Мусорное ведро 2.0
26: Оттенки серого
27: Неверное направление
28: Куда же направиться?
29: Широко открытый
30: Я тебя тоже вижу
31: Иллюминаты
32: Посылок нет
33: Зеленая рапсодия
34: Двойной прыжок
35: Раскрути этот лайм!
36: Коробка
37: Козырёк
38: Гуляю под лучами солнца
39: Быстрая перемотка
40: Шестигранный ящик
41: Петарда
42: Садовые ножницы
43: Не слишком толстый
44: Мусорный бак
45: Прямо вниз
46: Перемотка назад
47: Два сразу
48: Конец начала
49: Фиолетовый водоворот
50: Я не слышу тебя
51: Дежавю
52: Игра в формы
53: Кокос
54: Клякса
55: Тостер
56: Некоторым повезло
57: Сколько оттенков?
58: Лучше купить коричневый
59: Малиновое варенье
60: НЕ ОТКРЫВАТЬ
61: Вишнёвая бомба
62: Только в медицинских целях
63: Неаполитанский
64: 32 миллиона 
65: Прочитал это?
66: Гиза в сером
67: Уголь
68: Трогать осторожно
69: Кукольный туалет
70: Не чёрный
71: Цунами
72: Не слишком свежий
73: Гипноз
74: Опасная зона
75: Зарождение
76: 8 мяч
77: Оно живое!
78: Языки пламени
79: Откидной верх
80: Плавильный котёл
81: Мистер Браунстоун
82: ААААРГХ!!!
83: Пиксельный
84: Наблюдатель
85: Не в фокусе
86: Выпусти меня
87: Тройная проблема
88: Азимов
89: Я этого не делал
90: Пустота
91: Не к месту
92: Ломтик арбуза
93: Нормандия
94: Эндте
95: Время вышло
96: Аккуратный и правильный
97: Хром
98: Триумф
99: Поллок
100: Арахис
101: Номер два
102: Тор
103: Швейцарский
104: Клетка
105: Мобильная доставка 
106: Похмелье
107: Рождество
108: Горячая штучка
109: Где-то за радугой
110: Здоровье
111: Слэйд
112: Вокруг света
113: Суши ролл
114: Ты мой сладкий
115: Мусорный бак на колёсах
116: ЛаКрок
117: Кофе для вампира
118: Подключи и играй
119: Медовое наслаждение
120: Вход для Санты
121: Где тост?
122: Пьяный
123: Флойд
124: Мы желаем вам...
125: ...Счастливого рождества
126: Распишитесь здесь
127: Коробка конфет
128: Потому что я голоден
129: Пиво Санты
130: Тому с любовью от Джерри
131: Замок Ланцелота
132: С молоком и сахаром
133: Олаф
134: Осталось 10 секунд
135: Где соломинка?
136: Джерри с любовью от Тома
137: Винт
138: Искусственный газон
139: Заряженный
140: Смотровая площадка Лего
141: Кряк
142: Межгалактический
143: Зеленый бак для воды
144: Большие огненные шары
145: Сок Добрый 
146: Трам-там-там
147: Чистая энергия
148: Брось их
149: Не хватает кусочка
150: Невесомость
151: Ночь оживших бочек
152: Меркурий-сити-тауэр
153: Старый способ топки
154: Где бумага?
155: Где молоко?
156: 128 ГБ
157: Шоколадный батончик
158: Лягушонок Кермит
159: Надежды и мечты
160: Сердечный приступ
161: Просто продолжай плыть
162: Эндтемейстер
163: 2Д6
164: Напитки за мой счет
165: Бочка Баха
166: Все склеится!
167: Выход из комнаты
168: Цветной пазл
169: Планшет для игры в Скрап 2.0
170: Сделай решительный шаг
171: Что я?
172: Кого ты собираешься позвать
173: Без усилий нет результатов
174: Бесконечность
175: Что случилось, Док?
176: Мохито
177: Прибавь громкость!
178: Синяя рапсодия
179: Лесоруб
180: Перекур
181: Игра престолов
182: Мерзкий
183: Джекпот
184: Супер Марио Брос
185: Отключили электричество
186: Где бургер?
187: Тёмная сторона бочки
188: Извините меня!
189: Ананас
190: Мне остаться или уйти?
191: Если жизнь даёт тебе лимоны...
192: Не есть
193: Самайн
194: Мерло
195: Мяу!
196: Низкое разрешение
197: Чай для двоих
198: Эшер
199: Очищенный
200: Аль денте
201: Картонная рубашка
202: Джава
203: Кибер молоко
204: Чемпион
205: Съедобный
206: Пожалуйста, смойте!
207: Шардоне
208: 3.47
209: Т-вирус
210: Облако 9
211: Гавана
212: Антидот
213: Туз в рукаве
214: Пейот
215: Ниже нуля
216: 180
217: Не стрелять!
218: Огоньку не найдется?
219: Конец игры
220: Холодный
221: С днём рождения, Скрап 2
222: Зелье невидимости
223: Хранить в сухом месте
224: Перерезать синий провод...?
225: Масленица
226: Вечеринка с пиццей
227: Пуддинг
228: Марка не нужна
229: Удваиваю ставку
230: Бит
231: Карат
232: Прихлебывать
233: Джек и Джилл
234: Коровий сок
235: Летим со мной
236: Покойся с миром
237: Тревога! Хакеры!
238: Пятисторонняя башня 
239: Не слишком жгучий
240: Не слишком холодный
241: Где перец?
242: Что-то нереальное
243: Воздушный
244: Неразбериха
245: Где музыкальный автомат?
246: Еретик
247: Звездные войны
248: Патронник
249: Неон
250: Не облизывай
251: Рифленный
252: Печенье против крекеров
253: Девичник
254: Газированный
255: Вечная тьма
256: Мехико
257: Специальная доставка
258: Еще блинчиков?
259: Одного не хватает
260: У вас новое сообщение
261: Где иголка?
262: Вечеринка
263: Лекарство
264: Бочка Z264
265: ЭВМ
266: 2d(R-r)
267: Ярость
268: С любовью
269: Артиллерийский огонь
270: ЧС в туалете
271: Синяя стопка
272: Время для пончиков
273: Тропический коктейль
274: А она все таки вертится!
275: Оригинальная доставка
276: Где Текилла?
277: 16 направо, 23 налево
278: Синяя магия
279: Включить или выключить?
280: Изумительная кукуруза
281: По бочке в день
282: Открывать аккуратно
283: Хроники скрапа
284: Вкусно!
285: Пельмешки
286: Тессеракт
287: Время играть в Скрап
288: Радужный торт
289: Пора соединять бочки
290: Сушилка
291: Скрап.Деньги
292: Восковые мелки
293: Сахарные кубики
294: Годен до июля 2019 года
295: Есть мелочь?
296: Не птица
297: Искусно нарезанный
298: 1969
299: Не ронять
300: 300 Бочка!
301: Лицом к лицу
302: Шестеренки
303: Мои документы
304: Острый за мгновение
305: С ароматом лаванды
306: Губка
307: Поехали!
308: Где соус к ягненку?!
309: Можно кусочек?
310: Крутящий момент
311: Новый и улучшенный
312: Из ангара
313: Стиральная машина
314: Паста Пенне
315: Где майонез?
316: Еда студента
317: Очень вкусно
318: Вишневое наслаждение
319: Восхитительная выпечка
320: Детство
321: Чашечка кофе
322: Попался!
323: Прошлое и настоящее
324: Цепная реакция
325: Египетская, но не пирамида
326: Очень горячо!
327: Как это есть?!
328: Потряси
329: Где хот-дог?
330: Готово!
331: Утиный суп
332: В любом направлении
333: Здравая лягушка
334: Всего один стежок
335: Вопль
336: Теперь новый вкус!
337: Где масло?
338: Холодный приём
339: Пожалуйста, послушай это
340: Ниндзя
341: Комплект шин
342: Ничего не трогай
343: Курица или утка?
344: C2H5OH
345: Коробка с сюрпризом
346: Где мой бургер?
347: Лужайка
348: Подстрижемся?
349: Скрап чипсы
350: Что готовишь?
351: Не кормите разработчика
352: Гравитация
353: Свет & Тьма
354: Небоскрёб
355: Острый и ароматный
356: Мистер Робот
357: Ветчина
358: Как стать богатым
359: Теперь наоборот
360: Другое измерение
361: Шеф повар
362: Угадай слово
363: Починит что угодно
364: Где кролик?
365: 147
366: Нет в наличии
367: Каппучино
368: Разлом
369: Выздоравливай!
370: Спутник 15
371: Глубокий вдох
372: Твёрдое состояние
373: Бочка-компаньон
374: Дом, милый дом
375: Выберите свой любимый!
376: Собирать по 2
377: Залить в бензобак!
378: Шах и мат!
379: 1000 Градусов
380: Яичницу?
381: С одного удара
382: Лапша
383: Вкусно с кетчупом
384: Замороженная вкуснятина
385: Не пей быстро
386: Что играет?
387: 7.0
388: Горький цитрус
389: Подключить в розетку
390: Изысканный десерт
391: Сделай паузу
392: Символ величия
393: Витаминный коктейль
394: Так вкусно
395: Геном человека
396: Розы и шипы
397: Где рыцари?
398: Многоэтажка
399: Стоп… Время играть!
400: Поздравляю!
401: Брось монетку
402: Неизвестный бренд
403: Чай с шариками
404: Из морозилки
405: Где желе?
406: Вся история
407: Код 0000
408: 50 Гц
409: Цель достигнута
410: Где черника?
411: Космические волны
412: Витамин Д
413: Где бильярд?
414: Ты бы выпил это?
415: Максимальная энергия
416: Рай для курильщика
417: Масленица 3.0
418: Прошу, помоги мне
419: На них все держится
420: Еда на сегодня
421: Винтажное бюро
422: Шоколадная мечта
423: Бавария
424: Рождественский мишка
425: Мощь лазера
426: А это вкусно?
427: Заварник
428: Точка зрения
429: Куча витаминов
430: Сжечь это!
431: Навигатор разберется
432: Не тот рычаг
433: Он среди нас
434: Вечный покой
435: Часы заблокированы
436: Следующий уровень
437: Осторожно, яд
438: 1996-2020
439: Домашняя база
440: Соленый, но сладкий
441: Поможет справиться с жаждой
442: Да, у нас это есть!
443: Ореореореорео
444: Механизм создания
445: Мы заказали больше
446: Данные для диаграммы
447: Рокерская вечеринка
448: Пирамидка
449: Кто съел это?
450: Не для плавания
451: Просто оставь это
452: Резонанс
453: Покорми меня!
454: Не забывай поливать!
455: 5 чего?
456: Взрыв из Прошлого
457: Где сыр?
458: Гнилой!
459: Доставка в процессе
460: Любой цвет
461: Остановись прямо там!
462: Пицца Вито
463: Домашнее Средство
464: Муравьиная ферма
465: Чудесная Материя
466: Кря 4.0
467: Для Литературного Клуба 
468: Маленькая Книга Ужасов
469: Я счастливый турист!
470: Земля, Какой Мы Её Знаем 
471: Лампа сверху
472: Великая Жадность
473: Кто Виноват?
474: Башня Капрезе
475: Эстетизм
476: Кусочки, богатые калием
477: Последствия разрушения
478: Ежевичный десерт
479: Снежный леопард
480: Желе и арахисовое масло
481: Уже слишком поздно
482: Работа для сварщика
483: Сборник мудрых мыслей
484: Главный шкаф
485: Модный приговор
486: Тайный лифт
487: Снюхаемся позже!
488: РАШ Б!
489: От 8 до 16 бит
490: Вкусный десерт
491: Искрящийся вкус
492: Как укус комарика...
493: Многослойный
494: Странный Мир
495: Восковая Эпиляция
496: Новое поколение
497: Фруктовые кусочки
498: Кубики из желатина
499: Где обезьяны? 
500: Работа готова! 
501: Ускорься
502: Пора прибраться! 
503: Найдешь выход?
504: Давай закругляться!
505: Схема соединений готова 
506: Огнеопасно! 
507: Ярость дьявола 
508: Странная архитектура 
509: Заброшенный сад 
510: Лимонная кислота
511: Рождественские игры 
512: 12.65В 
513: Портативный холодильник 
514: Прототип 
515: Бодрящая настойка 
516: Кукурузные конфеты
517: Пентагон разрушений
518: Из гаража 
519: Таинство стихий
520: Кленовый сироп 
521: Плитки шоколада 
522: Ты должен построить...
523: Смертельная доза 
524: Направь его сюда! 
525: Японский бэнто 
526: Энергия красок 
527: Нажмите, держите, соединяйте! 
528: Гроссмейстер
529: Воспоминания 
530: Кто такой Джон? 
531: Шротт говорит 
532: Возвращение живой бочки 
533: Вы пробовали его изменить? 
534: Шестиугольник Шестиугольник
535: Удивительное Сокровище!
536: Найдите фрагменты
537: Ограниченная партия 
538: Исчезни! 
539: Сколько времени осталось?
540: Смотри под ноги!
541: Наследие 
542: Обновление завершено! 
543: Проводник 
544: Жуткая и страшная бочка 
545: Планета 9 
546: Дефрагментация!
547: Отправляйтесь в город
548: Космическая миссия
549: Событие
550: Торнадо EF5
551: Инопланетный лексикон
552: 4к оборотов в минуту
553: Кленовый слишком популярен
554: Наша версия Голливуда
555: Бабушкофон
556: Дешифровщик
557: Сырая и влажная проводка
558: Карамельный пирог в банке
559: Атомные хроники
560: Дом для хомячка
561: Исследование подземелья
562: Здесь, в моем гараже
563: С комфортом
564: Первоисточник
565: Итоговый заезд
566: Король бочек, Альфред
567: Съедобно?
568: Происхождение ПК
569: Быстро и четко!
570: Внезапная атака!
571: Защита от вампиров
572: Далеко...
573: Меда, пожалуйста!
574: 1 Миллион Сковиллей
575: Тайский Лимон
576: Сердце кочегара
577: Оригинальный Рецепт
578: Купер, ты слышишь?
579: Раздражающий Авиатор
580: Скрапео и Джульетта
581: Вышибала
582: Ошибка 503
583: Волшебная пыль
584: 6 футов под землей
585: Противопожарная защита 5
586: Через 50 лет...
587: Арсенал художника
588: Закат
589: Вкусный и полезный
590: Соединить или съесть?
591: Из тени
592: Пещера в бочке
593: Энергия твоего мусора
594: Ты получил макаруны!
`